; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph3 - mode
	thermograph1 - mode
	thermograph4 - mode
	spectrograph2 - mode
	image0 - mode
	Star0 - direction
	GroundStation6 - direction
	Star5 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star1 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument6 thermograph1)
	(supports instrument6 spectrograph3)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite1 GroundStation6)
	(pointing satellite3 Star7)
	(have_image Star7 image0)
	(have_image Phenomenon8 thermograph4)
	(have_image Phenomenon9 thermograph4)
	(have_image Star10 thermograph1)
	(have_image Phenomenon11 image0)
	(have_image Star12 thermograph4)
	(have_image Planet13 spectrograph2)
))

)

; plan
1. (turn_to satellite3 star1 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star1)
   goals met: 0 of 9
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 9
3. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 9
4. (turn_to satellite3 phenomenon9 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon9)
   goals met: 0 of 9
5. (take_image satellite3 phenomenon9 instrument6 thermograph4)
   added: (have_image phenomenon9 thermograph4)
   goals met: 1 of 9
6. (turn_to satellite3 phenomenon8 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon8)
   goals met: 1 of 9
7. (turn_to satellite0 groundstation6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 9
8. (take_image satellite3 phenomenon8 instrument6 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 2 of 9
9. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 9
10. (calibrate satellite0 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 2 of 9
11. (turn_to satellite0 phenomenon11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 9
12. (take_image satellite0 phenomenon11 instrument2 image0)
   added: (have_image phenomenon11 image0)
   goals met: 3 of 9
13. (turn_to satellite0 planet13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet13)
   goals met: 3 of 9
14. (take_image satellite0 planet13 instrument2 spectrograph2)
   added: (have_image planet13 spectrograph2)
   goals met: 4 of 9
15. (turn_to satellite0 star10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star10)
   goals met: 4 of 9
16. (take_image satellite0 star10 instrument2 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 5 of 9
17. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 5 of 9
18. (take_image satellite0 star7 instrument2 image0)
   added: (have_image star7 image0)
   goals met: 6 of 9
19. (turn_to satellite1 groundstation6 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation6)
   goals met: 7 of 9
20. (turn_to satellite3 star12 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star12)
   goals met: 7 of 9
21. (take_image satellite3 star12 instrument6 thermograph4)
   added: (have_image star12 thermograph4)
   goals met: 8 of 9
22. (turn_to satellite3 star7 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star7)
   goals met: 9 of 9
